lileding/DragonFlyBSD/sbin/mount_tarfs/mount_tarfs.8
.\"
.\" Copyright (c) 2026 The DragonFly Project.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd July 18, 2026
.Dt MOUNT_TARFS 8
.Os
.Sh NAME
.Nm mount_tarfs
.Nd mount a tar archive as a read-only file system
.Sh SYNOPSIS
.Nm
.Op Fl o Ar options
.Ar tarfile
.Ar mount_point
.Sh DESCRIPTION
The
.Nm
utility attaches a
.Xr tarfs 5
file system to the global file system name space.
The archive
.Ar tarfile
must be a regular file containing an uncompressed POSIX ustar
.Pq optional PAX
stream.
.Pp
.Nm
always mounts read-only.
If the
.Nm tarfs
file system type is not already present, the utility attempts to load
it with
.Xr vfsload 3 .
.Pp
The following options are available:
.Bl -tag -width indent
.It Fl o Ar options
Options are specified with a
.Fl o
flag followed by a comma-separated string of options.
See
.Xr mount 8
for standard options.
.El
.Sh EXAMPLES
.Bd -literal -offset indent
mount_tarfs /var/db/images/tree.tar /mnt
.Ed
.Pp
Decompress zstd first (kernel has no zstd):
.Bd -literal -offset indent
zstd -d archive.tar.zst -o /tmp/archive.tar
mount_tarfs /tmp/archive.tar /mnt
.Ed
.Sh SEE ALSO
.Xr tar 1 ,
.Xr tarfs 5 ,
.Xr mount 8 ,
.Xr umount 8
.Sh HISTORY
.Nm
appeared in the
.Dx
tarfs port.
.Sh EXIT STATUS
.Ex -std
